In [1]:
phrase = "I'm Emma" # String
print(phrase)

I'm Emma

In [2]:
x = 5 # Integer
y = 10 
z = x + y #plus symbol
print(z)
z = y / x #divide
print(z) # Float
print(type(z))

j=type(z)
print(j)

15
2.0
<class 'float'>
<class 'float'>

In [3]:
x = 5
y = 7
print(x*y)

35

In [4]:
r = 2
pi = 3.14
square = r**2
area = pi * (r**2)
print(area)

12.56

In [5]:
name ="Emma"
hobby = "running"
long_string = "My name is " + name + " and my hobby is " + hobby
#print(long_string)

phrase = f"My name is {name} and my hobby is {hobby}"
print(phrase)

My name is Emma and my hobby is running

In [6]:
name = "Emma"
role = "Performance Project Officer"
phrase = f"My name is {name} and my job title is {role}"
print(phrase)

My name is Emma and my job title is Performance Project Officer

In [7]:
print(len(phrase))
string_slice = phrase[3:15]
print(string_slice)

filename = "here_is_a_file.csv"
filename = filename[:-4]
print(filename)

63
name is Emma
here_is_a_file

In [8]:
slice_this_phrase = 'dog cat racoon'
dog = slice_this_phrase[0:3]
print(dog)
cat = slice_this_phrase[4:7]
print(cat)
racoon = slice_this_phrase[-6:]
print(racoon)
print(f"{dog} {cat} {racoon}")

dog
cat
racoon
dog cat racoon

In [9]:
list_1 = [1,2,3,x,y]
print(list_1)

[1, 2, 3, 5, 7]

In [10]:
favourite_colour = "teal"
colours_list = ["red", "blue", "green"]
colours_list.append(favourite_colour)
print(f"My colours are: {colours_list}")

My colours are: ['red', 'blue', 'green', 'teal']

In [11]:
food_list = ["potato", "pasta", "rice", "meat"]
favourite_food = "cheese"
print (food_list)
food_list.append(favourite_food)   
print(food_list)

['potato', 'pasta', 'rice', 'meat']
['potato', 'pasta', 'rice', 'meat', 'cheese']

In [12]:
food_list = ["potato", "pasta", "rice", "meat"]
new_food_list = ["apple", "banana","grape"]
print(new_food_list)
#food_list.append(new_food_list)
#food_list.extend(new_food_list)
print(food_list)

['apple', 'banana', 'grape']
['potato', 'pasta', 'rice', 'meat']

In [13]:
numbers_list = [2,3,4,5,1,6]
numbers_list.sort()

numbers_list = [2,3,4,5,1,6]
numbers_list.sort(reverse=True)
print(numbers_list)

[6, 5, 4, 3, 2, 1]

In [14]:
food_list = ["potato", "pasta", "Apples", "meat"]
food_list.sort()
print(food_list)

['Apples', 'meat', 'pasta', 'potato']

In [15]:
favourite_colours_dict = {'will':'purple',
                     'scout':['yellow', 'red'],
                     'crash':23,
                     'Naomi':{'Monday':'purple',
                               'EOD':'Yellow'}}
print(favourite_colours_dict)
print(favourite_colours_dict['Naomi'])
print(favourite_colours_dict.keys())
print(favourite_colours_dict.values())
print(favourite_colours_dict.items())

{'will': 'purple', 'scout': ['yellow', 'red'], 'crash': 23, 'Naomi': {'Monday': 'purple', 'EOD': 'Yellow'}}
{'Monday': 'purple', 'EOD': 'Yellow'}
dict_keys(['will', 'scout', 'crash', 'Naomi'])
dict_values(['purple', ['yellow', 'red'], 23, {'Monday': 'purple', 'EOD': 'Yellow'}])
dict_items([('will', 'purple'), ('scout', ['yellow', 'red']), ('crash', 23), ('Naomi', {'Monday': 'purple', 'EOD': 'Yellow'})])

In [16]:
restaurant_dict = {'Chippy':'chips',
                     'Chinese':['rice', 'sweet & sour'],
                     'Indian':{'curry':'naan'}}
print(restaurant_dict)
print(restaurant_dict['Indian'])
print(restaurant_dict.keys())
print(restaurant_dict.values())
print(restaurant_dict.items())

{'Chippy': 'chips', 'Chinese': ['rice', 'sweet & sour'], 'Indian': {'curry': 'naan'}}
{'curry': 'naan'}
dict_keys(['Chippy', 'Chinese', 'Indian'])
dict_values(['chips', ['rice', 'sweet & sour'], {'curry': 'naan'}])
dict_items([('Chippy', 'chips'), ('Chinese', ['rice', 'sweet & sour']), ('Indian', {'curry': 'naan'})])

In [17]:
favourite_colours_dict = {'will':'purple',
                     'scout':['yellow', 'red'],
                     'crash':23,
                     'Naomi':'Orange'}
favourite_colours_dict['Annie']='Blue'
favourite_colours_dict['Naomi'] = 'Blue'
favourite_colours_dict['Andy'] = 'Blue'
print(favourite_colours_dict)
print('Andy' in favourite_colours_dict)

{'will': 'purple', 'scout': ['yellow', 'red'], 'crash': 23, 'Naomi': 'Blue', 'Annie': 'Blue', 'Andy': 'Blue'}
True

In [18]:
job_dict = {'Emma':'Performance Officer',
            'Will':'Instructing',
            'Emily':'Perfommance Anylist',
            'Jon': 'Performance M',
            'Emma': 'Performance O',
            'Paul M':'Perf O',
            'Michael M': 'Regional',
            'Michael C': 'Anylist',
            'Paul D': 'Senior PM',
            'Nazahah': 'Analyst'
            }
names = list(job_dict.keys())
print(names)
for key,val in job_dict.items():
    print(f"My name is {key}, my job is {val}")

['Emma', 'Will', 'Emily', 'Jon', 'Paul M', 'Michael M', 'Michael C', 'Paul D', 'Nazahah']
My name is Emma, my job is Performance O
My name is Will, my job is Instructing
My name is Emily, my job is Perfommance Anylist
My name is Jon, my job is Performance M
My name is Paul M, my job is Perf O
My name is Michael M, my job is Regional
My name is Michael C, my job is Anylist
My name is Paul D, my job is Senior PM
My name is Nazahah, my job is Analyst

In [19]:
#Assignment 1.1
maths_dict = {}  #initialise a blank dictionary

x=7
y=5
add_var = (x+y)
sub_var = (x-y)
squared_var1 = (x**2)
squared_var2 = (y**2)
power_var = (pow(x,y))

maths_dict["Sum"] = add_var
maths_dict["Subtract"] = sub_var
maths_dict["Square x"] = squared_var1
maths_dict["Square y"] = squared_var2
maths_dict["Power"] = power_var

print(maths_dict)

{'Sum': 12, 'Subtract': 2, 'Square x': 49, 'Square y': 25, 'Power': 16807}

In [20]:
#Assignment 1.2
ccard = "4444444444444444"
print(ccard)
last4 = ccard[-4:]
print(last4)
len(ccard)
anon = "x"
non_anon = (len(ccard)-4)
print(non_anon)

print(anon * non_anon + last4)
len((anon * non_anon + last4))

4444444444444444
4444
12
xxxxxxxxxxxx4444

16

In [21]:
import pandas as pd

d = {"here's a column":['Val 1', 'Val 2', 'Val 3'],
     "here's another":['4, 5, 6'],
     "and another":['foo', 'bar', 'baz']}

print(d)

{"here's a column": ['Val 1', 'Val 2', 'Val 3'], "here's another": ['4, 5, 6'], 'and another': ['foo', 'bar', 'baz']}

In [22]:
import pandas as pd

dict_1 = {"heres's a column": ["val 1", "val 2", "val 3"],
         "col 2": [4,5,6],
          "col z": ["foo", "bar", "baz"] }

df_1 = pd.DataFrame(dict_1)
df_1

df_2 = pd.DataFrame([
    {'letter':'A',
     'word':'Foo',
     'number':1},
     {'letter':'b',
     'word':'Bar',
     'number':2},
     {'letter':'C',
     'word':'Baz',
     'number':3},
])

print(df_2)

  letter word  number
0      A  Foo       1
1      b  Bar       2
2      C  Baz       3

In [23]:
import pandas as pd

company = ([
{'Name': 'John Smith',
 'Job Title': 'Reception',
 'Salary': '10000'},
 {'Name': 'Jane Doe',
 'Job Title': 'Administration',
 'Salary': '12000'},
 {'Name': 'Mike Mann',
 'Job Title': 'Manager',
 'Salary': '15000'},
 {'Name': 'Mandy Mann',
 'Job Title': 'Director',
 'Salary': '20000'},
{'Name': 'Marge Mann',
 'Job Title': 'Director',
 'Salary': '20000'}
])

company_df = pd.DataFrame(company)

print(company_df)
company_df

         Name       Job Title Salary
0  John Smith       Reception  10000
1    Jane Doe  Administration  12000
2   Mike Mann         Manager  15000
3  Mandy Mann        Director  20000
4  Marge Mann        Director  20000

         Name       Job Title Salary
0  John Smith       Reception  10000
1    Jane Doe  Administration  12000
2   Mike Mann         Manager  15000
3  Mandy Mann        Director  20000
4  Marge Mann        Director  20000

In [24]:
#print(company_df.info())
#print(company_df.dtypes)
#print(company_df.head(1))
#print(company_df.tail(1))

company_df['Salary'] = company_df['Salary'].astype('int')
company_df.dtypes

Name         object
Job Title    object
Salary        int64
dtype: object

In [25]:
#print(company_df['Salary'].sum())

# company_salary_tot = company_df['Salary'].sum()
# print(company_salary_tot)

# company_salary_mean = company_df['Salary'].mean()
# print(company_salary_mean)

# company_salary_cumsum = company_df['Salary'].cumsum()
# print(company_salary_cumsum)

sal_min_max = f"Salary minimum:{company_df['Salary'].min()}, Salary maximum:{company_df['Salary'].max()}"
print(sal_min_max)

Salary minimum:10000, Salary maximum:20000

In [26]:
company_df['Date Started'] = ['06/12/1993', '01/06/1966','26/05/1964', '23/01/1968', '26/01/1976']
company_df

         Name       Job Title  Salary Date Started
0  John Smith       Reception   10000   06/12/1993
1    Jane Doe  Administration   12000   01/06/1966
2   Mike Mann         Manager   15000   26/05/1964
3  Mandy Mann        Director   20000   23/01/1968
4  Marge Mann        Director   20000   26/01/1976

In [27]:
inflation = 1.067
company_df['Salary'] = company_df['Salary'] * inflation

company_df['Pay After Bonus'] = company_df['Salary'] + 500
company_df['Salary'] = company_df['Salary'].astype('int')
company_df['Pay After Bonus'] = company_df['Pay After Bonus'].astype('int')
company_df

         Name       Job Title  Salary Date Started  Pay After Bonus
0  John Smith       Reception   10670   06/12/1993            11170
1    Jane Doe  Administration   12804   01/06/1966            13304
2   Mike Mann         Manager   16005   26/05/1964            16505
3  Mandy Mann        Director   21340   23/01/1968            21840
4  Marge Mann        Director   21340   26/01/1976            21840

In [28]:
#company_df['Date Started'] = pd.to_datetime(company_df['Date Started'], dayfirst=True)
company_df['Date Started'] = pd.to_datetime(company_df['Date Started'], format='%d/%m/%Y')
#company_df.dtypes
company_df

         Name       Job Title  Salary Date Started  Pay After Bonus
0  John Smith       Reception   10670   1993-12-06            11170
1    Jane Doe  Administration   12804   1966-06-01            13304
2   Mike Mann         Manager   16005   1964-05-26            16505
3  Mandy Mann        Director   21340   1968-01-23            21840
4  Marge Mann        Director   21340   1976-01-26            21840

In [29]:
company_df['DoB'] = ['06/12/1963', '01/06/1946','26/05/1934', '23/01/1928', '26/01/1956']
company_df['DoB'] = pd.to_datetime(company_df['DoB'], format='%d/%m/%Y')
company_df

         Name       Job Title  Salary Date Started  Pay After Bonus        DoB
0  John Smith       Reception   10670   1993-12-06            11170 1963-12-06
1    Jane Doe  Administration   12804   1966-06-01            13304 1946-06-01
2   Mike Mann         Manager   16005   1964-05-26            16505 1934-05-26
3  Mandy Mann        Director   21340   1968-01-23            21840 1928-01-23
4  Marge Mann        Director   21340   1976-01-26            21840 1956-01-26

In [30]:
company_df['Time Served'] = pd.to_datetime('16/11/2023', format='%d/%m/%Y') - company_df['Date Started']
company_df['Time Served'] = company_df['Time Served'] / pd.Timedelta('365 days')  #convert to years rather than default (days)
company_df['Time Served'] = company_df['Time Served'].round().astype('int', errors='ignore')   #rounds to full years
company_df

,Name,Job Title,Salary,Date Started,Pay After Bonus,DoB,Time Served
0,John Smith,Reception,10670,1993-12-06,11170,1963-12-06,30
1,Jane Doe,Administration,12804,1966-06-01,13304,1946-06-01,57
2,Mike Mann,Manager,16005,1964-05-26,16505,1934-05-26,60
3,Mandy Mann,Director,21340,1968-01-23,21840,1928-01-23,56
4,Marge Mann,Director,21340,1976-01-26,21840,1956-01-26,48

In [36]:
import pandas as pd

df_eatout = pd.DataFrame([
{'Restaurant': 'Emz',
 'Starter': 'Soup',
 'Main': 'Steak',
 'Dessert': 'Cake'},

 {'Restaurant': 'Bruz',
 'Starter': 'Pate',
 'Main': 'Pasta',
 'Dessert': 'Pie'},

 {'Restaurant': 'XXX',
 'Starter': 'Salad',
 'Main': 'Rice',
 'Dessert': 'Ice Cream'}
])

eatout_df

  Restaurant Starter   Main    Dessert
0        Emz    Soup  Steak       Cake
1       Bruz    Pate  Pasta        Pie
2        XXX   Salad   Rice  Ice Cream

In [10]:
import pandas as pd

child_info = pd.DataFrame([

    {'Child_ID': 'Child 1',
     'Gender': '0',
     'DOB': '05/05/2015',
     'Ethnicity': 'BANG',
     'PLACE': 'P1'},    
    
      {'Child_ID': 'Child 2',
     'Gender': '1',
     'DOB': '12/12/2020',
     'Ethnicity': 'WOTH',
     'PLACE': 'T1'},  

       {'Child_ID': 'Child 3',
     'Gender': '2',
     'DOB': '01/01/2000',
     'Ethnicity': 'MOTH',
     'PLACE': 'X1'},  

       {'Child_ID': 'Child 4',
     'Gender': '7',
     'DOB': '09/12/2017',
     'Ethnicity': 'WIRI',
     'PLACE': 'W1'},  
])

child_info['DOB'] = pd.to_datetime(child_info['DOB'], format='%d/%m/%Y')
child_info

  Child_ID Gender        DOB Ethnicity PLACE
0  Child 1      0 2015-05-05      BANG    P1
1  Child 2      1 2020-12-12      WOTH    T1
2  Child 3      2 2000-01-01      MOTH    X1
3  Child 4      7 2017-12-09      WIRI    W1

In [11]:
corporation = [{'Name':'Will LP',
                'Salary':'10000',
                'Job Title':'Employee'},
                {'Name':'Annie LP',
                'Salary':'15000',
                'Job Title':'CEO'},
                {'Name':'Naiomi LP',
                'Salary':'90000',
                'Job Title':'VP'},
                {'Name':'Luke V',
                'Salary':'45000',
                'Job Title':'Teach Lead'},
                {'Name':'Matt K',
                'Salary':'30000',
                'Job Title':'Comms'},
                {'Name':'Hannah K',
                'Salary':'38000',
                'Job Title':'HR'},]

corp_df = pd.DataFrame(corporation)


corp_df['Date Started'] = ['05/12/1993', '01/01/2000', '01/01/2020', '23/12/1989', '10/10/2010', '17/12/2021']

corp_df['Date Started'] = pd.to_datetime(corp_df['Date Started'], format='%d/%m/%Y')

corp_df

        Name Salary   Job Title Date Started
0    Will LP  10000    Employee   1993-12-05
1   Annie LP  15000         CEO   2000-01-01
2  Naiomi LP  90000          VP   2020-01-01
3     Luke V  45000  Teach Lead   1989-12-23
4     Matt K  30000       Comms   2010-10-10
5   Hannah K  38000          HR   2021-12-17

In [18]:
# Equals ==
# Not equal !=
# less than <
# greater than >
# greater or equal >=
#less or equal <=

corp_df['Salary'] = corp_df['Salary'].astype('int')

selection = corp_df['Salary'] > 40000
selection

over_40k = corp_df[selection]
under_40k = corp_df[~selection]
under_40k

       Name  Salary Job Title Date Started
0   Will LP   10000  Employee   1993-12-05
1  Annie LP   15000       CEO   2000-01-01
4    Matt K   30000     Comms   2010-10-10
5  Hannah K   38000        HR   2021-12-17

In [19]:
mask = corp_df['Salary'] > corp_df['Salary'].mean()
over_mean = corp_df[mask]
over_mean

        Name  Salary   Job Title Date Started
2  Naiomi LP   90000          VP   2020-01-01
3     Luke V   45000  Teach Lead   1989-12-23

In [58]:
import pandas as pd

child_info = pd.DataFrame([

    {'Child_ID': 'Child 1',
     'Gender': '0',
     'DOB': '05/05/2015',
     'Ethnicity': 'BANG',
     'PLACE': 'P1'},    
    
      {'Child_ID': 'Child 2',
     'Gender': '1',
     'DOB': '12/12/2020',
     'Ethnicity': 'WOTH',
     'PLACE': 'T1'},  

       {'Child_ID': 'Child 3',
     'Gender': '2',
     'DOB': '01/01/2000',
     'Ethnicity': 'MOTH',
     'PLACE': 'X1'},  

       {'Child_ID': 'Child 4',
     'Gender': '7',
     'DOB': '09/12/2017',
     'Ethnicity': 'WIRI',
     'PLACE': 'W1'},  
])

child_info['DOB'] = pd.to_datetime(child_info['DOB'], format='%d/%m/%Y')
child_info

  Child_ID Gender        DOB Ethnicity PLACE
0  Child 1      0 2015-05-05      BANG    P1
1  Child 2      1 2020-12-12      WOTH    T1
2  Child 3      2 2000-01-01      MOTH    X1
3  Child 4      7 2017-12-09      WIRI    W1

In [42]:
gender_error_df = child_info[child_info['Gender'] == '7']
print(gender_error_df)

ethnic_error_df = child_info[child_info['Ethnicity'] == 'BANG']
print(ethnic_error_df)

  Child_ID Gender        DOB Ethnicity PLACE
3  Child 4      7 2017-12-09      WIRI    W1
  Child_ID Gender        DOB Ethnicity PLACE
0  Child 1      0 2015-05-05      BANG    P1

In [48]:
child_info
mask = child_info['Gender'] == '7'

wrong_gender_codes = child_info[mask]
print(wrong_gender_codes)

correct_gc = child_info[~mask]
print(correct_gc)

incorrect_eth = child_info[child_info['Ethnicity'] =='BANG']
print(incorrect_eth)

correct_eth = child_info[child_info['Ethnicity'] !='BANG']
print(correct_eth)

  Child_ID Gender        DOB  Ethnicity PLACE
3  Child 4      7 2017-12-09        NaN    W1
  Child_ID Gender        DOB  Ethnicity PLACE
0  Child 1      0 2015-05-05        NaN    P1
1  Child 2      1 2020-12-12        NaN    T1
2  Child 3      2 2000-01-01        NaN    X1
Empty DataFrame
Columns: [Child_ID, Gender, DOB, Ethnicity, PLACE]
Index: []
  Child_ID Gender        DOB  Ethnicity PLACE
0  Child 1      0 2015-05-05        NaN    P1
1  Child 2      1 2020-12-12        NaN    T1
2  Child 3      2 2000-01-01        NaN    X1
3  Child 4      7 2017-12-09        NaN    W1

In [59]:
df = child_info
# df['Ethnicity']= df['Ethnicity'].str.lower()
# df

moth_woth = df[df['Ethnicity'].str.lower().isin('moth','woth')]
moth_woth

TypeError: Series.isin() takes 2 positional arguments but 3 were given